_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 80, 75, 64)        832       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 40, 37, 64)        16448     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 20, 19, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 20, 19, 64)        4160      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 10, 10, 64)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 6400)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               1638656   
_________________________________________________________________
activation_1 (Activation)    (None, 256)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 16)                4112      
=================================================================
Total params: 1,664,208
Trainable params: 1,664,208
Non-trainable params: 0
_________________________________________________________________
