_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 80, 75, 64)        832       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 40, 38, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 20, 19, 128)       32896     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 10, 10, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 5, 5, 256)         131328    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 3, 3, 256)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 1, 1, 512)         524800    
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 1, 1, 512)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                32832     
_________________________________________________________________
activation_1 (Activation)    (None, 64)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 8)                 520       
_________________________________________________________________
activation_2 (Activation)    (None, 8)                 0         
=================================================================
Total params: 723,208
Trainable params: 723,208
Non-trainable params: 0
_________________________________________________________________
None
