_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 53, 50, 64)        1792      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 26, 25, 32)        8224      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 13, 12, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 6, 6, 16)          2064      
_________________________________________________________________
flatten_1 (Flatten)          (None, 576)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 576)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               73856     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                1290      
=================================================================
Total params: 87,226
Trainable params: 87,226
Non-trainable params: 0
_________________________________________________________________
