_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 159, 149, 64)      832       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 79, 74, 128)       32896     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 40, 37, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 20, 18, 128)       65664     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 10, 9, 128)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 11520)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               2949376   
_________________________________________________________________
activation_1 (Activation)    (None, 256)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 16)                4112      
=================================================================
Total params: 3,052,880
Trainable params: 3,052,880
Non-trainable params: 0
_________________________________________________________________
