{"config": [{"config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [2, 2], "batch_input_shape": [null, 160, 150, 3], "activation": "elu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "dtype": "float32", "name": "conv2d_1", "filters": 64, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [2, 2], "activation": "elu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "name": "conv2d_2", "filters": 128, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [2, 2], "activation": "elu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "name": "conv2d_3", "filters": 256, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_size": [2, 2], "activation": "elu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "name": "conv2d_4", "filters": 512, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "units": 128, "trainable": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "units": 8, "trainable": true, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow"}